[[1, "olenz", "This will add a new \"File Sorting\" Tab to the preferences that allows to exactly specify the sort and export order of entries, rather than the rather limited set of choices that were available to date.", "03/12/14 11:38:01 AM", " =||= ", "New Sorting/Export preferences"], [2, "simonharrer", "This adds basic gradle integration. The project files for Intellij and Eclipse can be generated and JabRef can be started from within the IDEs as well as the tests can be run with errors. ", "03/12/14 06:29:22 PM", " =||= ", "Basic gradle integration"], [3, "egonw", " =||= ", "03/15/14 12:55:32 PM", " =||= ", "Some example new Dutch translations via the GitHub web page."], [4, "jtornero", "Three new strings translated.", "03/17/14 10:20:50 PM", "1", "Spanish translation update"], [5, "was123", "Indonesian translation added", "03/18/14 05:12:53 AM", " =||= ", "Update JabRef_in.properties"], [6, "olenz", " =||= ", "03/19/14 07:46:25 PM", " =||= ", "Fixed splash-dev.svg"], [7, "noravanq", "```\nThe user can now specify an arbitrary number of file-link columns in te \"Entry table columns\" preferences tab, to be added to the main table. The user can any file types specified in the list of External File Types. The extra columns work exactly like the original file-link column.\n\nFor each file-link column whenever there are multiple files, the letter \"m\" is displayed at the bottom right corner of the icon.\n```\n\n Committer: noravanq\n\n On branch master\n Changes to be committed:\n   (use \"git reset HEAD <file>...\" to unstage)\n\n```\nmodified:   src/main/java/net/sf/jabref/GUIGlobals.java\nmodified:   src/main/java/net/sf/jabref/JabRefPreferences.java\nmodified:   src/main/java/net/sf/jabref/TableColumnsTab.java\nmodified:   src/main/java/net/sf/jabref/gui/MainTableFormat.java\nmodified:   src/main/java/net/sf/jabref/gui/MainTableSelectionListener.java\nmodified:   src/main/java/net/sf/jabref/gui/PreventDraggingJTableHeader.java\n```", "03/23/14 04:03:12 PM", " =||= ", " I have implemented 2 features requested in Ticket #841."], [8, "adaerr", "This pull-request pertains to the addition of metadata to PDF files associated with entries, as triggered by the menu entry \"Write XMP metadata to PDFs\" in the \"Tools\" menu. XMP is an extremely interesting feature that allows tagging PDF files (amongst others) with automatically retrievable metadata in much the same way mp3-tags allow adding title/author/... information to mp3 music files. Actually JabRef exports the metadata not only to two XMP namespaces (Dublin Core and a custom JabRef namespace), but also to the PDF DocumentInformation Object.\n\nPractically from the beginning of the XMP-writing capabilities of JabRef, Christopher Oezbek had added _privacy filtering_ for the XMP-tagging of PDF-files with data from the bibtex-record, meaning that the user could define a list of fields (in Preferences->XMP metadata) which should _not_ be exported to the PDF file.  Unfortunately, the filtering was incomplete: jabref exports the metadata in three different forms, only one of which was originally filtered. In 2013 filtering was extended to both XMP namespaces, but JabRef still exported _all_ fields into the PDF DocumentInfo object. The two present commits correct this problem. The first (b45316f) prevents private fields from being exported to the PDF DocumentInfo. The second one more agressively erases these fields even if they already exist in the PDF document. \n\nThe deletion of existing fields might be debateable. It seems the right thing to do for fields clearly generated by JabRef (viz. those prefixed by \"jabref/\"), but there are four fields which might be of other origin (Author,Title,Subject and Keywords). Making a systematic exception for these four fields, i.e. not erasing them even if they are privacy filtered, is a bad idea and violates the principle of least surprise. This is why the second commit makes no exception. Deactivating the erasure for the four generic fields could however easily be added as an option in the XMP export preferences if it is judged important. The current behaviour has the advantage of reliably correcting PDF files previously tagged with a buggy privacy filtering.\n\nIf these commits are pulled into the master branch and confirmed to work, the bug #869 on the sourceforge tracker: \nhttps://sourceforge.net/p/jabref/bugs/869/\ncan be closed.", "04/23/14 09:23:03 PM", "1", "PDF-file metadata: Privacy Filtering all metadata"], [9, "ansell", "Adds a FullTextFinder implementation to transform the ACS DOI redirect URLs to their PDF download equivalents.", "05/20/14 12:53:43 PM", " =||= ", "Support FindFullText with ACS DOIs"], [10, "braindevices", "Hi All,\nI just upgraded to 2.10 and I found some bugs immediately.\n1. in the right-click-menu there is no `move-to-group` but 2 `remove\nfrom group` instead.\n2. I like the new add/remove/move panel, but the scrolling is not\nworking, which is a big problem. Because I have lots of groups which\ncannot even fit into the full screen height after expansion.\n3. no way to expand or collapse all nodes\n\nI tried the dev version, all problems still exist. Here is my fixation.\n\nCheers,\n\nW.L.", "05/20/14 12:55:20 PM", "1", "try to fix some obvious bugs about `groups`"], [11, "vegeziel", "Found bug: PubMed/Medline PLAIN format recognized as RIS format.\nProvided solution:\n    - Modified RIS ImportFilter. Now RIS format is identified by looking for the \"TY\" tag (it is a mandatory tag in RIS format and it is not conflictual with other filters)\n    - Added new ImportFilter \"MedlinePlain\". This import filter parses Medline files in plain format (not XML). The import filter has been produced referring to the official Medline documentation (http://www.nlm.nih.gov/bsd/mms/medlineelements.html)\n    - Updated the net.sf.jabref.core plugin.xml file in order to include the newly added MedlinePlain import filter", "06/28/14 12:38:20 AM", " =||= ", "BugFix for bug \"#880 PubMed Import broken\""]]