[["1", "New Sorting/Export preferences", "Olaf Lenz", "olenz", "03/12/14, 11:38:01 AM", "This will add a new \"File Sorting\" Tab to the preferences that allows to exactly specify the sort and export order of entries, rather than the rather limited set of choices that were available to date.", "NaN"], ["2", "Basic gradle integration", "Simon Harrer", "simonharrer", "03/12/14, 06:29:22 PM", "This adds basic gradle integration. The project files for Intellij and Eclipse can be generated and JabRef can be started from within the IDEs as well as the tests can be run with errors. ", "NaN"], ["3", "Some example new Dutch translations via the GitHub web page.", "Egon Willighagen", "egonw", "03/15/14, 12:55:32 PM", "NaN", "NaN"], ["4", "Spanish translation update", "Jorge Tornero", "jtornero", "03/17/14, 10:20:50 PM", "Three new strings translated.", "Even though the other translation files have been updated, I accept this pull request.\nFor next time, please try to commit only the \"really\" changed file and revert the changes of the other one. You can also use the edit button at https://github.com/JabRef/jabref/blob/master/src/resource/JabRef_es.properties\n =||= "], ["5", "Update JabRef_in.properties", null, "was123", "03/18/14, 05:12:53 AM", "Indonesian translation added", "NaN"], ["6", "Fixed splash-dev.svg", "Olaf Lenz", "olenz", "03/19/14, 07:46:25 PM", "NaN", "NaN"], ["7", " I have implemented 2 features requested in Ticket #841.", null, "noravanq", "03/23/14, 04:03:12 PM", "```\nThe user can now specify an arbitrary number of file-link columns in te \"Entry table columns\" preferences tab, to be added to the main table. The user can any file types specified in the list of External File Types. The extra columns work exactly like the original file-link column.\n\nFor each file-link column whenever there are multiple files, the letter \"m\" is displayed at the bottom right corner of the icon.\n```\n\n Committer: noravanq\n\n On branch master\n Changes to be committed:\n   (use \"git reset HEAD <file>...\" to unstage)\n\n```\nmodified:   src/main/java/net/sf/jabref/GUIGlobals.java\nmodified:   src/main/java/net/sf/jabref/JabRefPreferences.java\nmodified:   src/main/java/net/sf/jabref/TableColumnsTab.java\nmodified:   src/main/java/net/sf/jabref/gui/MainTableFormat.java\nmodified:   src/main/java/net/sf/jabref/gui/MainTableSelectionListener.java\nmodified:   src/main/java/net/sf/jabref/gui/PreventDraggingJTableHeader.java\n```", "NaN"], ["8", "PDF-file metadata: Privacy Filtering all metadata", "Adrian Daerr", "adaerr", "04/23/14, 09:23:03 PM", "This pull-request pertains to the addition of metadata to PDF files associated with entries, as triggered by the menu entry \"Write XMP metadata to PDFs\" in the \"Tools\" menu. XMP is an extremely interesting feature that allows tagging PDF files (amongst others) with automatically retrievable metadata in much the same way mp3-tags allow adding title/author/... information to mp3 music files. Actually JabRef exports the metadata not only to two XMP namespaces (Dublin Core and a custom JabRef namespace), but also to the PDF DocumentInformation Object.\n\nPractically from the beginning of the XMP-writing capabilities of JabRef, Christopher Oezbek had added _privacy filtering_ for the XMP-tagging of PDF-files with data from the bibtex-record, meaning that the user could define a list of fields (in Preferences->XMP metadata) which should _not_ be exported to the PDF file.  Unfortunately, the filtering was incomplete: jabref exports the metadata in three different forms, only one of which was originally filtered. In 2013 filtering was extended to both XMP namespaces, but JabRef still exported _all_ fields into the PDF DocumentInfo object. The two present commits correct this problem. The first (b45316f) prevents private fields from being exported to the PDF DocumentInfo. The second one more agressively erases these fields even if they already exist in the PDF document. \n\nThe deletion of existing fields might be debateable. It seems the right thing to do for fields clearly generated by JabRef (viz. those prefixed by \"jabref/\"), but there are four fields which might be of other origin (Author,Title,Subject and Keywords). Making a systematic exception for these four fields, i.e. not erasing them even if they are privacy filtered, is a bad idea and violates the principle of least surprise. This is why the second commit makes no exception. Deactivating the erasure for the four generic fields could however easily be added as an option in the XMP export preferences if it is judged important. The current behaviour has the advantage of reliably correcting PDF files previously tagged with a buggy privacy filtering.\n\nIf these commits are pulled into the master branch and confirmed to work, the bug #869 on the sourceforge tracker: \nhttps://sourceforge.net/p/jabref/bugs/869/\ncan be closed.", "thx!\n =||= "], ["9", "Support FindFullText with ACS DOIs", "Peter Ansell", "ansell", "05/20/14, 12:53:43 PM", "Adds a FullTextFinder implementation to transform the ACS DOI redirect URLs to their PDF download equivalents.", "NaN"], ["10", "try to fix some obvious bugs about `groups`", null, "braindevices", "05/20/14, 12:55:20 PM", "Hi All,\nI just upgraded to 2.10 and I found some bugs immediately.\n1. in the right-click-menu there is no `move-to-group` but 2 `remove\nfrom group` instead.\n2. I like the new add/remove/move panel, but the scrolling is not\nworking, which is a big problem. Because I have lots of groups which\ncannot even fit into the full screen height after expansion.\n3. no way to expand or collapse all nodes\n\nI tried the dev version, all problems still exist. Here is my fixation.\n\nCheers,\n\nW.L.", "After 2.10 the BibtexEntryType.java is changed a lot. The optional fields and required fields are very different. If one need the field order is exactly the same as the 2.9.2, one should manually define the order. 2.10 also fixes some bugs in entry sorting. Some entries will be always different from 2.9.2. So I think backward-compatibility does not make sense any more. If one really want the bib file arranged in the same way as 2.9.2, he should just use 2.9.2. Upgrade all client to 2.10 makes more sense here.\n =||= "], ["11", "BugFix for bug \"#880 PubMed Import broken\"", null, "vegeziel", "06/28/14, 12:38:20 AM", "Found bug: PubMed/Medline PLAIN format recognized as RIS format.\nProvided solution:\n    - Modified RIS ImportFilter. Now RIS format is identified by looking for the \"TY\" tag (it is a mandatory tag in RIS format and it is not conflictual with other filters)\n    - Added new ImportFilter \"MedlinePlain\". This import filter parses Medline files in plain format (not XML). The import filter has been produced referring to the official Medline documentation (http://www.nlm.nih.gov/bsd/mms/medlineelements.html)\n    - Updated the net.sf.jabref.core plugin.xml file in order to include the newly added MedlinePlain import filter", "NaN"], ["12", "BugFix for #959 \"StringIndexOutOfBoundsException with invalid Preview text\"", "Ingvar Jackal", "IngvarJackal", "07/16/14, 06:57:22 PM", "Fixed #959 \"StringIndexOutOfBoundsException with invalid Preview text\". java.lang.StringIndexOutOfBoundsException handled: message dialogue shows with last five words before illegal backslash expression and trace is written in stderr.", "NaN"], ["13", "Language locale fix for BugFix #959", "Ingvar Jackal", "IngvarJackal", "07/23/14, 02:39:11 PM", "I tried to change hard code with in-code strings to Global.lang and changed icon for dialogue window from warning to error.", "Dear All,\n\nI'm trying to update the spanish translation file via GIT. How to get \naccentuated characters? (à, è, ì...)\n\nI see that in the file they appear scaped \\e003 and all.\n\nBest regards\n\nJorge Tornero\n\nEl 23/07/14 16:39, Oliver Kopp escribió:\n\n> Merged #13 https://github.com/JabRef/jabref/pull/13.\n> \n> —\n> Reply to this email directly or view it on GitHub \n> https://github.com/JabRef/jabref/pull/13#event-144679715.\n =||= Try to use Popeye - http://jabref.sourceforge.net/langproper-0.55.jar. This tool shouldn't have problems with escaping.\n =||= "], ["14", "BugFix for \"#960 FileNotFoundException in Journal abbreviations window\"", "Ingvar Jackal", "IngvarJackal", "08/05/14, 10:40:50 PM", "Fixed bug #960 FileNotFoundException in Journal abbreviations window. I added error dialogue and added the check while initializing in order to to fix missed file (it sets personalJournalList to \"\" if so).", "NaN"], ["15", "Make (un)abbreviating journal titles also work on the journaltitle field", null, "dahlheim", "08/20/14, 10:02:58 AM", "I've (i) added the toggle button to the \"journaltitle\" field editor\nand (ii) made the abbreviate/unabbreviate actions change both the \"journal\" and \"journaltitle\" fields.\nThe latter might be a bit simple-minded --  should the field to consider depend on whether Biblatex mode is actually turned on?", "NaN"], ["16", "fixed the bug 960", null, "edukempf", "09/08/14, 12:55:03 PM", "Hi I am Eduardo, I'm a student of UTFPR - Brazil, I was proposed in one of the subjects I am studying make some contributions to a free software project, so I was passed on this project. This is my first contribution, so follows the correction of a bug I found in the following link: http://sourceforge.net/p/jabref/bugs/960/. \n\nTo fix the bug made ​​some changes to the system to validate the path provided by the user, and if the file does not exist it is created, checks were made for both Windows and for Linux. \n\nI am sending my pull-request. \n\nps :. sorry my english", "Thank you for the PR. Did you add yourself to About.html and the change to the CHANGELOG as described in [CONTRIBUTING.MD](https://github.com/JabRef/jabref/blob/master/CONTRIBUTING.md)?\n =||= Yes, I already did.\n =||= Thank you for your contribution. Can you fix the issues with the current master branch so I can merge the pull request in automatically?\n =||= Think, pull request #14 already adressed that issue and makes this PR obsolete.\n =||= "], ["17", "Solved the task #850 Keyboard shortcut for 'Cleanup entries'", "Eduardo Greco", "eduardogreco", "08/29/14, 12:25:24 PM", "I solved the task of link:\nhttps://sourceforge.net/p/jabref/feature-requests/850/\n\nI am a student at the Federal University of Paraná - Brazil and I'm contributing to the JabRef because I think very important  open source software.", "NaN"], ["18", "Fix edits getting lost in Biblatex mode", null, "dahlheim", "09/08/14, 11:54:53 AM", "This fixes a bug where edits made in a field on a\nCompressedEntryEditorTab wouldn't get stored when the field editor lost\nfocus.\nThe bug was caused by EntryEditorTabFocusListener accessing the unused inherited parent field\nof CompressedEntryEditorTab instances instead of the latter class's own (private) parent field.\nInstead of doing just a quick fix, I decided to eliminate the excessive code and data duplication\nin the two classes altogether and consolidate them into one class (with an additional flag to the constructor),\nsince I don't think an extra class is warranted here (and easily and sensibly implementable by derivation).", "Thank you for the PR. Did you add yourself to About.html as described in [CONTRIBUTING.MD](https://github.com/JabRef/jabref/blob/master/CONTRIBUTING.md)?\n =||= Yes, I already did.\n =||= Thanks for your patch. Can you please resolve the conflicts towards the master branch so that I can merge the pull request automatically?\n =||= Done.\n =||= "], ["19", "Fix error when setting unset field in source panel", null, "dahlheim", "08/29/14, 12:24:44 PM", "When the user tries to set a previously unset field of an entry via the\nsource panel of the entry editor, the program complains with an error\nmessage and refuses to store the field values.\nThis change fixes that behaviour.", "NaN"], ["20", "Update to gradle 2.1", "Jörg Lenhard", "lenhard", "09/11/14, 09:14:42 AM", "Just a minor update to the gradle version.", "Thank you for this patch! :+1: \n =||= "], ["21", "Fix bug 950", "Thiago Gomes Toledo", "thiagogt", "10/16/14, 01:26:35 PM", "The getBasePath() was returning NullPointerException, because the method was trying to create a File using a null basePath. I changed the getBasePath method to return a String, create a getFileFromBasePath and where the old getBasePath was called, I changed it to getFileFromBasePath, verifying if basePath was null. ", "Ok simonharrer, its done. Thanks for reminder me.\n =||= "], ["22", "Extended the 'unknown entry type' error message ", "Tobias Diez", "tobiasdiez", "10/19/14, 03:24:15 PM", "I had problems locating which entry had this unknown entry type and hence extended the error message to also include the bibtex key.", "Thank you for your pull request! This is a helpful contribution.\n =||= "], ["23", "Fixed bug 949", "Renato Massao", "rmmsilva", "10/21/14, 09:40:26 AM", "An IOException is caught when the user tries to load an invalid jar file in the menu Options/\"Manage custom imports\", but this exception is not properly treated, because its stack trace is thrown into the stdout. Now it is being properly logged and not thrown into the stdout.  ", "Thank you for your contribution. \n =||= "], ["24", "Extend BibLatex: support for alias fields", "Tobias Diez", "tobiasdiez", "10/27/14, 03:43:52 PM", "- Added support for aliased fields. For example, the content in the 'journaltitle' field is also shown in the 'journal' table.\n- Added cleanup option to convert to the new BibLatex format\n- Modified the required/optional fields for BibLatex entries to reflect the above changes (the 'year' field is no longer required)", "NaN"], ["25", "adapted a pattern to parse DBLP entries.", "Mattias Ulbrich", "SatiricalThumb", "10/30/14, 07:14:35 PM", "DBLP seems to send `<pre class=\"verbatim select-on-click\">` now instead of only `<pre>`.", "In commit 019ef561 I created a CHANGELOG entry and added you in the Authors.html as described in the [CONTRIBUTING.md](https://github.com/JabRef/jabref/blob/master/CONTRIBUTING.md).\n =||= Thanks! and sorry I did not comply with the protocol.\n =||= "], ["26", "Fix for bug #958: ArrayIndexOutOfBoundsException ", "Deleted user", "ghost", "10/30/14, 07:13:00 PM", "ArrayIndexOutOfBoundsException was produced when the user  tried to apply changes in \"Setup selectors\" right after closing all databases. Now the exception is caught and a message is shown, telling the user that the changes could not be applied.", "NaN"], ["27", "Partial fix for bug #913", "Yara Grassi Gouffon", "yaragg", "10/27/14, 03:40:18 PM", "Realized many fields were not being exported, not only in .csv and .ods formats as stated in the bug report, but in .sxc as well. I fixed the export for both .ods and .sxc, but couldn't figure out how to fix it for .csv.", "NaN"], ["28", "Added special fields 'Printed' and 'Read status'", "Tobias Diez", "tobiasdiez", "10/28/14, 06:19:46 PM", "Added special fields 'Printed' and 'Read status', thereby implementing (at least partially):\n- Feature #762 Printed attribute\n- Feature #692 Marking of new entries and often read entries\n- Feature #685 Highlight new entries that were \"forgotten\"\n- Feature #602 could add the mark as read feature\n- Feature #225 read? checkbox\n\nPrinted is just a boolean toggle and for the read field currently the values 'Skimmed' and 'Read' are possible (if you have any suggestions for further possibilities, I'm happy to implement them). The icons are taken from http://www.softicons.com/system-icons/crystal-project-icons-by-everaldo-coelho and should probably be replaced with icons from the same collection as the other currently used ones.", "This feature is availale on JabRef 2.10?\nWhat should I do to get them?\n =||= No it is not in 2.10 but in the current development version. So you have to wait until 2.11 comes out or build the current version yourself. How to do the latter is described here: https://github.com/JabRef/jabref#building-jabref-from-source\n =||= Thank you very much.\nI'm could not install gradle on my laptop (ubuntu 14.04).\nLooking forward to the 2.11 release.\n =||= "], ["29", "Fixed bug #1240. 1-char strings working correctly.", "Leonardo Haddad Carlos", "leeohaddad", "10/30/14, 07:08:19 PM", "Fixed bug #1240, about an error thrown when trying to add a string with length of one character.", "NaN"], ["30", "Fix undoing Cleanup/Convert to Biblatex", null, "dahlheim", "10/30/14, 07:19:57 PM", "When Cleanup/Convert to Biblatex converted year/month fields to a date\nfield, it used to store erroneous undo information. This change fixes\nit.", "Thank you for the patch. Could you add a CHANGELOG entry (see [CONTRIBUTING.md](https://github.com/JabRef/jabref/blob/master/CONTRIBUTING.md))\n =||= In commit 31a60770, I added the missing CHANGELOG entry.\n =||= "], ["31", "Take aliased fields into account when sorting entries", null, "dahlheim", "11/03/14, 07:40:00 PM", "NaN", "NaN"], ["32", "Small bugfixes/improvements for biblatex support", "Tobias Diez", "tobiasdiez", "12/02/14, 06:03:46 PM", "Fixed bug where conversion of a bibtex year/month representation to the biblatex date field an invalid date would be generated (i.e. 2013-1 instead of 2013-01)\n\nAdded basic formating of date fields in cleanup", "Thank you for your patch. \n\nThe fix for the BibtexEntry can be accepted immediately. \n\nHowever, JabRef is currently targeting Java 7, while you made use of classes from Java 8 in CleanUpAction. Hence, this part of the pull request cannot be accepted at this point in time.\n\nIs it wise to include Joda time? Or should this be done with the old and antique class Calendar? @koppor \n =||= I think a workaround with the old Calendar class is way more complicated since the day-part is optional and as much as I know about the old time classes such situations are hard to handle.\nOn the other hand, I think the feature in CleanUpAction is not that important and useful for other users and could be skipped as long as Jabref targets Java 7 (it was morally a feature to repair the damage caused by the bug in BibtexEntry).\n =||= I split the commit and put it into the master branch with commit d0b4faf7.\n =||= "], ["33", "Feature 809: import Pubmed Central ID", "Philip Johnson", "grrrats", "12/03/14, 09:03:30 AM", "Import \"pmc\" field into bibtex from pubmed/medline records.  This field is analogous to other pubmed identifiers (pubmed id, doi, pii) and is used in NIH grant applications when listing publications produced by NIH-funded work.\n\nI was working on my grant progress report and realized this change was easy to make, so I went ahead and did it.  Since there was already a feature request, seems others are interested too.", "Thank you for your contribution. \n =||= "], ["34", "Fix encoding for DOI import", "Brian Quistorff", "bquistorff", "12/07/14, 11:54:23 PM", "Get the right encoding for the data from DOI import. Then, for\nconvenience, also replace the en-dash so that most entries can compile\nunder latex without modification.\nFixes: http://sourceforge.net/p/jabref/bugs/1213/", "Thank you for your pull request. Did you already add yourself to the About.html as a contributor as described in the CONTRIBUTION.md?\n =||= Thanks. Hopefully this additional diff does that.\n =||= "], ["35", "Solve the bug '1248 Key bindings not modified'", null, "alauber", "05/13/15, 12:55:07 PM", "After checking the bug '1248 Key bindings not modified', it was Identified que the creation of the hashmap list 'defKeyBinds' that sets the standard keyboard shortcuts, the feature 'Open folder' was not included in the 'defineDefaultKeyBindings ( )' method in 'JabRefPreferences' class .\nIn the creation of the menu item in the 'JabRefFrame' class for the item 'Open folder', it was not possible to recover the value of the item in the list 'defKeyBinds', occurring error 'NullPointerException' in the 'String makeEscape (String s) 'method in 'JabRefPreferences' class, which shouldnt return the value of 'String' to fill out the menu item.\nWhen the 'User' tried to change and save the list, the error 'NullPointerException' not allow the execution of the procedure.\nTo solve the bug , was included in the verification of the presence of null in 'keyBinds' list (copy of 'defKeyBinds'), the value 'Not associated' being passed to the 'String' return.\nThe warning that menu feature is created in the 'JabRefFrame' class without associated keyboard shortcut, was moved to the method mentioned before, as was duplicated.", "Thanks for the PR. Please add yourself to About.html as described in  [CONTRIBUTING.MD](https://github.com/JabRef/jabref/blob/master/CONTRIBUTING.md)\n =||= I would also prefer not to include the first two commits (8e46928 and 1e1ca6). Or are they interesting for guys working on the issue?\n =||= Nope. It is ok to not include the first two commits Oliver\n =||= I cherry-picked the last commit which converted to commit 522d8e43\n =||= "], ["36", "Fix for bug #1253: Cleanup entries error 2", null, "ruytakata", "04/01/15, 09:42:33 AM", "Committer: Ruy Minoru Ito Takata ruy.takata@gmail.com\n\nWhen using the \"Cleanup entries\" function, the special character Å should be converted to {{\\AA}} to preserve the capital when generating the PDF.", "NaN"], ["37", "Change DOI importer to use application/x-bibtex", "Nathan Sheffield", "nsheff", "04/09/15, 09:02:12 AM", "Changes the CrossRef content negotiation method to yield more complete bibtex entries. This fixes an issue with DOI import from papers with many authors, which previously yielded truncated results.", "Please see [CrossRef content negotiation documentation](http://crosscite.org/cn/) for information about why I propose this change\n =||= Thank you for the update. Could you also adapt the CHANGELOG and the About.html as described at https://github.com/JabRef/jabref/blob/master/CONTRIBUTING.md?\n =||= I can -- but it was just a single line change so I wasn't sure it was worth adding myself as a contributor, or updating the CHANGELOG. Do you still want those updates for such a simple change?\n =||= Yeah, sure.\n =||= Done.\n =||= "], ["38", "Fix for bug #919: Accents don't export to RTF", null, "ruytakata", "04/27/15, 03:01:31 PM", "Tests with various accented characters were made. The result was: \nÇ ü é ã á ä à å ç ê ë è ï í ì î Ä Å É æ Æ ô ö ò û ù ÿ Ö Ü ó ú ñ Ñ Ã Á Â À Ð Ê Ë È Í Î Ï Ì Ó Ô Ò õ Õ Ú Û Ù ý Ý ø Ø ï", "GitHub has the disadvantage that it continues updating the pull request when new commits flow into a branch. Therefore, the \"Cleanup entries error 3\" commit went into this PR. Should be OK for now, but for the next PRs, please make a separate branch for each fix :)\n =||= About the commit, very sorry. I did a commit with the first modification, and I dont know how I should do the second. I'm learning to use the github yet.\n =||= About the \"`A\", in my environment I tested all the characters listed (Ç ü é ã á ä à å ç ê ë è ï í ì î Ä Å É æ Æ ô ö ò û ù ÿ Ö Ü ó ú ñ Ñ Ã Á Â À Ð Ê Ë È Í Î Ï Ì Ó Ô Ò õ Õ Ú Û Ù ý Ý ø Ø ï). Those who had problems I changed. (Print of a example attached before the change)\n\n![jabref](https://cloud.githubusercontent.com/assets/11490603/7329140/8c740f8a-eab2-11e4-9348-61c88c89779e.png)\n![rtf](https://cloud.githubusercontent.com/assets/11490603/7329139/8c72b2b6-eab2-11e4-935e-c54323339369.png)\n\nMy enviroment is a Archlinux with Java 1.8.0_45. I will try to find a Windows enviroment to test before send more commits in the future.\n =||= The fix in HTMLConverter is incorrect for the accented i:s. With the modification the accent is added to a normal i, while in the old version it was added to a dot-less i (\\i).\n =||= I did not understand. Can you explain in more detail? I tested all \"i\" characters and seem correct to me.\n =||= See, e.g., https://en.wikibooks.org/wiki/LaTeX/Special_Characters especially\n\n\"To place a diacritic on top of an i or a j, its dot has to be removed. The dotless version of these letters is accomplished by typing \\i and \\j.\"\n =||= "], ["39", "Fix for bug #1269 (SF)", "Igor Steinmacher", "igorsteinmacher", "05/13/15, 12:39:38 PM", "Fix for a bug. Patch sent via other fork. Changed  class BibtexParser to accommodate the fix", "NaN"], ["40", "Fix for bug #876: Windows 7/8/10 - Pinning Jabref to the taskbar", "Tobias Diez", "tobiasdiez", "05/11/15, 04:15:52 PM", "Previously, JabRef couldn't be pinned to the taskbar ([bug report](https://sourceforge.net/p/jabref/bugs/876/)). The reason is that, by wrapping JabRef with Launch4j, Windows thinks only Java is running and does not recognize JabRef as something separate.\n\nBased on a [stackoverflow question](http://stackoverflow.com/questions/9330209/whats-the-best-way-to-start-java-applications-on-windows-7) the fix proceeds in two stages:\n- During the setup, we create a (dummy) shortcut and set the [Application User Model Id](https://msdn.microsoft.com/en-us/library/windows/desktop/dd378459%28v=vs.85%29.aspx). For this, we use the [WinShell plugin](http://nsis.sourceforge.net/WinShell_plug-in) for NSIS.\n- At program start, we notify Windows that this JabRef instance has the AppUserModelId specified in the setup. In order to do this, we invoke native commands using the Java Native Access (JNA) library. ", "Thank you for the pull request. My issue is that it includes commits not being related with the fix. The typical way of creating pull requests is to have a separate branch for each pull request. So we can discuss each improvement separately.\n\nThe comment is very useful. However, it would be better to place it in the commit message to have it stored in the git repository, too. We have an initial code documentation at https://sourceforge.net/p/jabref/wiki/Development_Howtos/, but I think, that is the wrong place for that.\n =||= I see your point! The other git commits just revert some local changes so that I'm in sync with your repository. All changes in \"Files changed\" are needed for this fix. \nSince I'm new to git, I would welcome if you could provide me tips how I can now remove the unnecessary commits and add the above description to the commit message. Thanks.\n =||= "], ["41", "Updated some paths in Launch4j configuration file", "Tobias Diez", "tobiasdiez", "05/12/15, 09:35:55 AM", "In order that the Launch4j build task works, some paths in the configuration file have to be changed.", "NaN"], ["42", "Fix for bug #876: Windows 7/8/10 - Pinning Jabref to the taskbar now works", "Tobias Diez", "tobiasdiez", "05/13/15, 12:44:22 PM", "Previously, JabRef couldn't be pinned to the taskbar ([bug report](https://sourceforge.net/p/jabref/bugs/876/)). The reason is that, by wrapping JabRef with Launch4j, Windows thinks only Java is running and does not recognize JabRef as something separate.\n\nBased on a [stackoverflow question](http://stackoverflow.com/questions/9330209/whats-the-best-way-to-start-java-applications-on-windows-7) the fix proceeds in two stages:\n- During the setup, we create a (dummy) shortcut and set the [Application User Model Id](https://msdn.microsoft.com/en-us/library/windows/desktop/dd378459%28v=vs.85%29.aspx). For this, we use the [WinShell plugin](http://nsis.sourceforge.net/WinShell_plug-in) for NSIS.\n- At program start, we notify Windows that this JabRef instance has the AppUserModelId specified in the setup. In order to do this, we invoke native commands using the Java Native Access (JNA) library.", "NaN"], ["43", "Update to UI: Remove some borders", "Tobias Diez", "tobiasdiez", "05/16/15, 09:39:19 PM", "I tried to remove some 'clutter' in the UI by removing the gridlines and a few borders.\nBefore:\n![before](https://cloud.githubusercontent.com/assets/5037600/7570437/936bc8a8-f810-11e4-9dc9-29e9c948c879.JPG)\nAfter:\n![after](https://cloud.githubusercontent.com/assets/5037600/7570438/936bd99c-f810-11e4-909e-7c0f729541d8.JPG)", "I am not immediately convinced that this a good idea. I am afraid that it makes it harder to align various fields of each entry visually when looking over a large database. \n =||= Agreed with Thomas. Although it looks cleaner, for those of us who have\nolder eyes, it may get a little tricky not having the gridlines.\n\n2015-05-11 12:57 GMT-05:00 Thomas Arildsen notifications@github.com:\n\n> I am not immediately convinced that this a good idea. I am afraid that it\n> makes it harder to align various fields of each entry visually when looking\n> over a large database.\n> \n> —\n> Reply to this email directly or view it on GitHub\n> https://github.com/JabRef/jabref/pull/43#issuecomment-100998852.\n =||= Is there a way to make is as an option in Preferences?\n\n## \n\nIgor Fabio Steinmacher, Ph.D.\nProfessor in Dept. of Computing at Universidade Tecnológica Federal do\nParaná\n\nOn Mon, May 11, 2015 at 3:01 PM, hakova notifications@github.com wrote:\n\n> Agreed with Thomas. Although it looks cleaner, for those of us who have\n> older eyes, it may get a little tricky not having the gridlines.\n> \n> 2015-05-11 12:57 GMT-05:00 Thomas Arildsen notifications@github.com:\n> \n> > I am not immediately convinced that this a good idea. I am afraid that it\n> > makes it harder to align various fields of each entry visually when\n> > looking\n> > over a large database.\n> > \n> > —\n> > Reply to this email directly or view it on GitHub\n> > https://github.com/JabRef/jabref/pull/43#issuecomment-100998852.\n> \n> —\n> Reply to this email directly or view it on GitHub\n> https://github.com/JabRef/jabref/pull/43#issuecomment-100999948.\n =||= I had the same filling.\nWhat about a gray strip every five entries?\n(see attached file)\n\nFrédéric\n\nLe 11/05/2015 19:57, Thomas Arildsen a écrit :\n\n> I am not immediately convinced that this a good idea. I am afraid that\n> it makes it harder to align various fields of each entry visually when\n> looking over a large database.\n> \n> —\n> Reply to this email directly or view it on GitHub\n> https://github.com/JabRef/jabref/pull/43#issuecomment-100998852.\n\n## \n\n.......................................................\nUR Science du Sol\nINRA\n2163 Avenue de la Pomme de Pin\nCS 40001 - Ardon\nF-45075 Orléans Cedex 2\nFrance\n  Ph:   +33 2 38 41 48 23\n  Fax:  +33 2 38 41 78 69\n  Email: Frederic.Darboux@orleans.inra.fr\n  WebPage: http://huit.re/DarbouxInraEn\n  Lab.: http://www6.val-de-loire.inra.fr/ur-sols/\n =||= ## I think it's a fine idea of it can be toggled in the preferences. \n\nSent from my Android device with K-9 Mail. Please excuse my brevity.\n =||= Ok, I will add an option to toggle the gridlines on and off. Originally, I also planned to add alternating background colors to better distinguish between rows. However, since JabRef also allows for marking entries, I doubt that this is a good approach. \n =||= ## I think you're right about the background colours. It could easily collide with marked entries.\n\nSent from my Android device with K-9 Mail. Please excuse my brevity.\n =||= Also I am not a Java programmer (and may be because I am not...), I \nbelieve it may not be difficult to add some gray to every five lines to \nwhatever is the color of the background (while, yellow, orange, red).\n\nFrédéric\n\nLe 11/05/2015 21:35, Tobias Diez a écrit :\n\n> Ok, I will add an option to toggle the gridlines on and off. Originally,\n> I also planned to add alternating background colors to better\n> distinguish between rows. However, since JabRef also allows for marking\n> entries, I doubt that this is a good approach.\n> \n> —\n> Reply to this email directly or view it on GitHub\n> https://github.com/JabRef/jabref/pull/43#issuecomment-101026697.\n\n## \n\n.......................................................\nUR Science du Sol\nINRA\n2163 Avenue de la Pomme de Pin\nCS 40001 - Ardon\nF-45075 Orléans Cedex 2\nFrance\n  Ph:   +33 2 38 41 48 23\n  Fax:  +33 2 38 41 78 69\n  Email: Frederic.Darboux@orleans.inra.fr\n  WebPage: http://huit.re/DarbouxInraEn\n  Lab.: http://www6.val-de-loire.inra.fr/ur-sols/\n =||= I added an option (under 'Appearance') to re-enable the gridlines. Moreover, it is now possible to change the row height.\n =||= "], ["44", "Add entry under the 'View' menu to hide the toolbar", "Tobias Diez", "tobiasdiez", "05/13/15, 12:32:09 PM", "In addition, I would suggest to hide the toolbar by default. ", "NaN"], ["45", "Added the option to change the table row height padding.", "Adam Rehn", "adamrehn", "05/13/15, 12:34:20 PM", "Previously, the padding added to the row height for the main table was hardcoded.\nThe padding value can now be modified by the user through the preferences dialog.\nThe old hardcoded value is used as the default value for the new preference.", "NaN"], ["46", "Add option to hide/show gridlines in the main table", "Tobias Diez", "tobiasdiez", "05/17/15, 02:02:05 PM", "Cleaned-up version of older pull request https://github.com/JabRef/jabref/pull/43", "NaN"], ["47", "Added the ability to reorder the panels in the side pane.", "Adam Rehn", "adamrehn", "05/18/15, 07:11:12 PM", "Side pane panels now feature an up arrow button and a down arrow button immediately to the left of the close button. These buttons allow panes to be swapped with the pane above or below them, respectively.\n\nWhenever the panes are reordered, the current position of each visible pane is recorded in the application preferences, so the user's custom ordering can be preserved when JabRef is next run.", "Thank you for the PR. It would be nice if you would add a CHANGELOG entry for the next update. See [CONTRIBUTING.md](https://github.com/JabRef/jabref/blob/master/CONTRIBUTING.md).\n =||= @koppor Sorry about that oversight, and thank you for taking the time to fix it. I'll be sure to include CHANGELOG entries in all non-trivial pull requests in future.\n =||= "], ["48", "Add the option to save selected entries as plain BibTeX.", "Adam Rehn", "adamrehn", "05/19/15, 12:53:16 PM", "Adds a new menu option called \"Save selected as plain BibTeX ...\".\n\nThis option behaves the same way as the existing \"Save selected as ...\" option, except that the JabRef metadata and signature comment are not written to the resulting output file.", "Thank you for your pull request. The feature is interesting. \n\nI would suggest to improve code quality a little bit by applying one of suggestions of the _Item 40: Design method signatures carefully_ of the Effective Java book: _Prefer two-element enum types to boolean parameters_\n =||= @simonharrer That's an excellent suggestion. The use of an enum facilitates easily adding further export customisations in future, if desired. I've updated the code accordingly.\n =||= Can you add yourself to the list of Contributors according to the https://github.com/JabRef/jabref/blob/master/CONTRIBUTING.md file, please, to give you credit for submitting this patch. \n =||= My name has already been added to the contributors list in [a previous commit](https://github.com/JabRef/jabref/commit/8d4ce91c026626c71545ad2ceeece27f0554a291).\n =||= Ok, then thank you again for this pull request. \n =||= "], ["49", "Minor UI Fix: Add \"Save selected as plain BibTeX...\" to the list of open database-only actions.", "Adam Rehn", "adamrehn", "05/20/15, 07:08:51 AM", "The \"Save selected as plain BibTeX...\" menu option is now correctly enabled and disabled based on whether or not a database is currently open.\n\nI haven't included a CHANGELOG entry, since this commit effectively just corrects a minor oversight on my behalf when adding this menu entry in [a previous pull request](https://github.com/JabRef/jabref/pull/48), but I'm happy to add one if deemed necessary.", "NaN"], ["50", "Trim journal names before looking up the Abbreviation", "wpoely86", "wpoely86", "05/20/15, 10:00:00 AM", "Some journals put trailing space in the journal names when\nexporting a bibtex citation. This causes the abbreviation\nto fail. This should fix that.", "NaN"], ["51", "update of the journal list", "wpoely86", "wpoely86", "05/20/15, 09:59:22 AM", "I've used this list of https://github.com/wpoely86/jabref-abbreviations\n\nCreated by:\n`cat journalList.txt list-abbreviations.txt | LC_COLLATE=C sort | uniq > journalList.txt`", "NaN"], ["52", "Added two journals to abbreviation list", "wpoely86", "wpoely86", "05/24/15, 07:37:50 PM", "Follow up from #51. I forgot two journals.", "NaN"], ["53", "Added some predefined look and feels in preference window ", "Tobias Diez", "tobiasdiez", "05/26/15, 11:05:06 PM", "Added some predefined look and feels in preference window (some of them are documented [here](https://sourceforge.net/p/jabref/mailman/message/32703401/), but are not working by default on windows).", "NaN"], ["54", "Fix for Bug #1278 Crash after changing LookAndFeel", "Tobias Diez", "tobiasdiez", "05/29/15, 08:39:45 PM", "Now a proper error message is shown at start if the L&F is not available.\nMoreover, only available L&Fs are listed in the preference window.", "NaN"], ["55", "Mac bundle and integration for Java 7", null, "NicosPavlov", "05/31/15, 06:46:36 PM", "These changes creates a new compilation target for JabRef, in order to make a Mac application bundle which can work with the newer Oracle JVM for Mac (versions 7 and 8), and change the code of the wrapper to integrate the Apple events with the non-deprecated API in com.apple.eawt.\n\nMain changes are:\n- Create a new target based on Oracle's appbundler to create a bundle compatible with newer JVMs. (not compatible with Apple's JVM).\n- Move the older target to Jabref-legacy.app.\n- Remove the old deprecated wrapper OSXAdapter, which does not work with Oracle's JVM.\n- Create new wrapper based on com.apple.eawt (compatible with both JVMs).\n- Improve the quit behaviour.\n- Add support for the Fullscreen feature.\n\nThe code changes are compatible with both Oracle's JVMs and Apple legacy one, but the legacy bundle is currently broken as the code requires Java 1.7+. Tested with Apple's JVM (1.6.0_65) and Oracle's JVM (1.8.0_45).", "NaN"], ["56", "Fix double-click opening of files on Mac", null, "NicosPavlov", "05/31/15, 06:32:48 PM", "Moving the registration of Apple events ensures that double-clicking on a file to open it works even if JabRef is not yet running.", "NaN"], ["57", "Add a Gitter chat badge to README.md", "The Gitter Badger", "gitter-badger", "06/15/15, 11:40:57 AM", "### JabRef/jabref now has a Chat Room on Gitter\n\n@simonharrer has just created a chat room. You can visit it here: [https://gitter.im/JabRef/jabref](https://gitter.im/JabRef/jabref?utm_source=badge&utm_medium=badge&utm_campaign=pr-badge&content=body_link).\n\nThis pull-request adds this badge to your README.md:\n\n[![Gitter](https://badges.gitter.im/Join%20Chat.svg)](https://gitter.im/JabRef/jabref?utm_source=badge&utm_medium=badge&utm_campaign=pr-badge&utm_content=body_badge)\n\nIf my aim is a little off, please [let me know](https://github.com/gitterHQ/readme-badger/issues).\n\nHappy chatting.\n\nPS: [Click here](https://gitter.im/settings/badger/opt-out) if you would prefer not to receive automatic pull-requests from Gitter in future.", "NaN"], ["58", "Fixed typo that prevented ant builds", null, "nikmilpv", "06/21/15, 11:29:27 AM", "NaN", "What do you mean by \"prevent ant builds\"? Even with the patch, `ant jars` outputs `Compile failed; see the compiler error output for details.`, because the compiler cannot find certain packages.\n\n`gradlew antTargets.release` runs through even without the patch.\n\n`Apache Ant(TM) version 1.9.5 compiled on May 31 2015`. Which version do you have, what is your output?\n =||= I'm building on Linux. Without the patch, both `./gradlew antTargets.jars` and `./gradlew antTargets.release.linux` fail, because the compiler can't find the dependencies. On the other hand, `./gradlew generateSource` and `./gradlew jar` run fine.\n\nAfter some digging around, I found that paths in `configurations.compile.asPath` are separated by `:` instead of `;` -- at least on Linux, don't know if that's the case on other platforms.\n\nI haven't tried `ant jars` and I doubt it would work, because the paths to dependencies are now passed through gradle.\n =||= It is different on Linux and Windows. I wrapped the thing in an if statement :). Thank you for testing and providing a PR.\n =||= Sure, no problem :)\n =||= "], ["59", "Fixing bug 1282 Save then Load from database (PostgreSQL) adds extra \"\\\" to existing text", null, "mariprudencio", "10/01/15, 11:53:51 PM", "Changed \"DBExporter.java\" to don't add extra \"\\\" in postgreSQL", "Thank you for your pull request. \n\nCan you please add yourself to the list of contributors as shown in CONTRIBUTING.md\n\nAnd the last thing: can you please add an item to the CHANGELOG describing your bug fix in short?\n =||= https://sourceforge.net/p/jabref/bugs/1282/\n =||= Moved to PR #198 \n =||= "], ["60", "Updating the translation entries from Brazilian Portuguese (pt_BR)", "Igor Steinmacher", "igorsteinmacher", "07/02/15, 06:23:45 PM", "NaN", "NaN"], ["61", "Fixes several FindBugs warnings and improve code quality", "Jörg Lenhard", "lenhard", "07/18/15, 12:20:08 PM", "I ran Findbugs on the source tree, had a look at several of the warnings and fixed those that were fixable from my point of view. When I touched a class, I also tried to eliminate Eclipse warnings if they were present.\n\nThis is really just a minor bump in code quality. Many warnings remain to be fixed.", "I fixed the aspects mentioned above\n =||= e8fec297ee348952ad5f92d3d8376725ee688ee7 adds logging code for broken links.\n =||= "], ["62", "Remove local jgoodies dependency", "Jörg Lenhard", "lenhard", "07/21/15, 09:58:01 AM", "This pull request replaces two classes that were contained in a local self-made jgoodies dependency. Thereby, the local dependency can be deleted.\n- `SimpleInternalFrame` is replaced by `JXTitledPanel` from the swingx project (This adds a new dependency from maven)\n- The `UIFSplitPane` is replaced by the standard swing `JSplitPane`. This is just one step up in the inheritence hierarchy. As far as I can see, there is no visual difference in the result.", "NaN"], ["63", "Refactor Preferences", "Jörg Lenhard", "lenhard", "07/21/15, 01:06:04 PM", "This pull request started with the target to add some new uni tests, but ended up as a refactoring of `JabRefPreferences`.\n\nFunctionwise, it changes nothing, but only refactors the preferences:\n- All default preferences are provided as constants and sorted together in the class\n- Key bindings are extracted from the preferences and grouped in a separate class. The methods of `JabRefPreferences` relating to key bindings do not change in their signature, but just internally.", "NaN"], ["64", "Update dependencies if possible", "Jörg Lenhard", "lenhard", "07/21/15, 02:14:25 PM", "This pull request updates all dependencies to their newest versions. \n\nThe only dependency for which this is not possible is antlr3. Here the upgrade from 3.4 to 3.5.2 would introduce API-breaking changes.", "NaN"], ["65", "Replace usages of preferences by string through constants", "Jörg Lenhard", "lenhard", "07/22/15, 06:47:44 PM", "I checked all the usage of strings for getting or setting preferences and replaced them by a the usage of a constant, if one existed. This gives some more static checking and consistency throughout the project. Changes are limited to `src/main/java`. \n\nAgain this changes nothing functionwise, but only improves code quality.", ":+1: \n =||= "], ["66", "fixed incompatibility with INSPIRE output page", "Stefano", "steog88", "07/23/15, 12:53:46 PM", "Due to a change in the html output of the INSPIRE search, JabRef was no more able to distinguish the interesting output from the rest of the page. It was due to a missing newline character.", "Thank you for your pull request. \n\nCan you please replace indexOf() != -1 with contains calls? Contains is semantically identical, but more concise. \n =||= Thanks for the suggestion, i did it.\n =||= Thank you for the quick response. Is it possible that you create a CHANGELOG entry and add yourself to the About.html? See [CONTRIBUTING.md](https://github.com/JabRef/jabref/blob/master/CONTRIBUTING.md) for detailed instructions.\n =||= Sorry, i didn't notice that file. Now I should have done everithing, though probably not in the most efficient way...\n =||= Thank you again for your contribution to JabRef!\n =||= @steog88 You just might have added the changes to this pull request by adding commits to your branch (as you did for the update at 84aa6e0.\n =||= "], ["67", "deprecated url", "Stefano", "steog88", "07/23/15, 11:33:46 AM", "NaN", "Thank you for your pull request. \n =||= "], ["68", "Update SPIRESBibtexFilterReader.java", "Stefano", "steog88", "07/23/15, 11:30:59 AM", "Fixed compatibility with new html output from SPIRES", "NaN"], ["69", "Update CHANGELOG", "Stefano", "steog88", "07/23/15, 12:54:06 PM", "NaN", "NaN"], ["70", "Update About.html", "Stefano", "steog88", "07/23/15, 12:53:57 PM", "NaN", "NaN"], ["71", "Streamline logging", "Jörg Lenhard", "lenhard", "07/29/15, 12:25:54 PM", "This pull request streamlines the usage of logging APIs in JabRef. All direct usages of `java.util.logging` are now replaced by usages of `commons.logging`. Internally, `commons.logging` is configured to default to `java.util.logging`, so nothing is fundamentally changed. `java.util.logging` is still needed in a single class, `CacheableHandler`, to access the actual log for display in the UI. This is not possible directly with `commons.logging` and requires the usage of the underlying logging API.\n\nThe major benefits are of this pull request are:\n- All classes use the same mechanism for logging\n- Many log messages have been checked and improved if possible\n- It is now easier to switch out the internal logging implementation ", "NaN"], ["72", "Bump pdfbox dependency versions", "Jörg Lenhard", "lenhard", "07/29/15, 01:09:15 PM", "I think it should be fine to enable flexible updates for new patch versions of pdfbox.", "I am against using + for versions, as developers could use different versions of the jars locally - which may lead to different behaviour. \n =||= Fixed with newest commit. I also added missing documentation in the CHANGELOG that should have been part of pull request #71 \n =||= "], ["73", "Removes old TODO file", "Stefan Kolb", "stefan-kolb", "07/29/15, 02:14:16 PM", "This information should be tracked inside the bug tracker.\nIn case the information is still needed, there is now a bug report at https://sourceforge.net/p/jabref/bugs/1292/.", "NaN"], ["74", "Refactor Globals", "Jörg Lenhard", "lenhard", "07/29/15, 02:33:00 PM", "This pull request reduces the infamous Globals class to one third of its size. This is achieved by extracting every variable or method that is only used once to the position of its usage. In the case of char maps several map classes have been extracted.", "NaN"], ["75", "Code style", "Stefan Kolb", "stefan-kolb", "07/29/15, 04:17:01 PM", "Some minor code style cleanups.", "NaN"], ["76", "Fix typo and propose renaming", "Stefan Kolb", "stefan-kolb", "07/29/15, 05:21:24 PM", "`libaries -> libraries`.\nI think `external` is more appropriate here. ", "NaN"], ["77", "Code style", "Stefan Kolb", "stefan-kolb", "07/29/15, 05:21:38 PM", "More minor code style cleanups.", "NaN"], ["78", "Add myself to the list of contributors", "Stefan Kolb", "stefan-kolb", "07/29/15, 05:39:53 PM", "NaN", "NaN"], ["79", "Unify Licenses", "Stefan Kolb", "stefan-kolb", "07/29/15, 07:45:08 PM", "The idea behind this is to solely rely on one license and version for the project.\nCurrently, GPL version 2 is set as official license for Jabref.\n\nTherefore, all other licenses are removed from the repository and GPL2 is moved to a general LICENSE file.\n\nAdditionally, I corrected paths to the files (README, LICENSE) inside the build scripts (esp. Ant) and removed a missing file dependency (jgoodies.txt).\n\nIs this feasible this way? \nWhat do you guys think @simonharrer @koppor ?", "NaN"], ["80", "Yet another code style iteration", "Stefan Kolb", "stefan-kolb", "07/29/15, 09:02:09 PM", "NaN", "NaN"], ["81", "Move classes for the Options->Preferences dialog to gui", "Jörg Lenhard", "lenhard", "07/30/15, 10:56:52 AM", "This pull request moves the classes that make up the Options->Preferences dialog into a seperate package in gui and performs a few quality improvements upon them", "NaN"], ["82", "Move FieldEditor", "Jörg Lenhard", "lenhard", "07/30/15, 01:09:55 PM", "Moves all implementations of the FieldEditor interface to a seperate gui package and performs various refactorings and quality improvements on them.", "NaN"], ["83", "Refer to new issue tracker", "Stefan Kolb", "stefan-kolb", "08/01/15, 07:38:47 PM", "I replaced the information for the old SF bug tracker inside the GUI application.\nAm I missing any locations? \nAt the moment it is only replaced inside `About.html`.", "Thank you. i think, all other About.html flies (of the other languages) have to be checked.\n =||= Good point, the others languages don't include this information somehow :hushed:\nInformation generally differs between languages :unamused:\nI think I'll be working on excluding redundant information like authors so we don't need to synchronize them in every language file.\n =||= the cli help message also refers to sourceforge instead of github. maybe we should replace this as well.\n\nSent from my iPad\n\n> On 01.08.2015, at 21:37, Stefan Kolb notifications@github.com wrote:\n> \n> Good point, the others languages don't include this information somehow \n> Information generally differs between languages \n> I think I'll be working on excluding redundant information like authors so we don't need to synchronize them in every language file.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n =||= "], ["84", "Dev 2.11", "fc7", "fc7", "08/03/15, 07:50:48 PM", "Trivial fix to restore missing imports in the MacAdapter", "Thank you for your pull request. Can you please add yourself to the list of contributors according to the CONTRIBUTORS instructions?\n =||= Of course, will do!\n =||= I have added my name to the list of contributors in About.html\nI have added some more minor commits to improve code readability (which also led to a minor bugfix).\n =||= "], ["85", "Fix package declaration in LabelPatternUtilTest", "Jörg Lenhard", "lenhard", "08/03/15, 10:15:01 AM", "The package declaration in this class is syntactically wrong. For some reason, this does not bother gradle, which still runs the test (Eclipse, however, doesn't). This is kind of alarming, since this code should not compile.", "NaN"], ["86", "Automate contributors list", "Stefan Kolb", "stefan-kolb", "08/07/15, 08:32:14 AM", "The list of contributors can now be auto generated via `scripts/generate-authors.sh`.\n\nIt uses an additional `.mailmap` file to merge different name/email configurations of unique authors.\nThe list is in sync with the old manual list from `About.html`.\nMissing manual entries are concatenated in `scripts/generate-authors.sh`for now.\n\nImho, we should either skip missing authors, or map them to unmapped commit emails.\nI'm not sure how many commits are missing in our history and in which way these people contributed.\nMaybe @koppor can shed some light on this.\n\nThe idea is to use this file to replace our contributors list inside `About.html` automatically without losing contributor's information or being inconsistent between languages etc.\nWe may have to do some changes to the file structure, e.g. attribute _name_ only, but this PR is mainly for unifying our data first.\n\nThe script itself `scripts/generate-authors.sh` can either be included in the build process or executed manually at times, as it may be beneficial if we oversee the mapping process by a human.", "@stefan-kolb The thing is that the old version control system used before was Subversion, which does not support the difference between author and committer. [JabRef switched to git in November, 2011](http://osdir.com/ml/java-jabref-devel/2011-11/msg00006.html). That means, all commits before November 2011 may have wrong author information. Furthermore, after November 2011 not all patches have been applied using `--author`.\n =||= Also, is the author list generation script automatically part of JabRef's build procedure? In that case, it could exclude most Windows users? \n =||= @ThomasA It is not (yet?) part of the build procedure. Even if it was Windows users should be able to run it with Cygwin or MSYS.\n =||= I was just thinking that if this is the only shell-dependent step in \nbuilding JabRef, it might be a major nuisance to anyone on Windows if \nthey would have to install and build in Cygwin just for this. This could \npotentially disrupt the workflow of most Windows contributors.\nI am just speculating here. I don't know how many Windows contributors \nthere are and I am using Linux myself.\n =||= I do not think that this is an issue because when having git installed locally on windows, there must at the moment be also the basic unix tools available as well because git relies upon them. (I am a windows developer)\n\nBut this stirrs up another interesting question. The previous scripts that were used to generate the homepage pages out of the authors were written in perl, which is yet another dependency. And we have python scripts in the repository as well. Maybe we should just use a single scripting language for all the scripts to reduce the learning overhead?\n =||= OK, I just wanted to make sure this issue was considered.\nAs for a unifying scripting language, I highly favour Python but then \nagain, I hardly contribute to JabRef nowadays.\n =||= Of course, using a single scripting language will make the maintenance easier.\nI suggest to define a preferred scripting language for _future development_.\n\nAbout existing scripts: I believe to rewrite all of them is not a high priority for JabRef development. Maybe conversion of the critical ones (which are to be identified).\n =||= "], ["87", "Location of JabRef backup files", "Stefan Kolb", "stefan-kolb", "01/25/16, 05:25:58 PM", "Personally, I find it distracting to have the `*.bak` backup files inside my project folders.\nAs we discussed at our [Brass-Meeting](http://www.brasserie-bamberg.de/) :beer:, we may move the location of these files to `AppData`or any other temporary folder to keep the user directory clean.", ":+1: \n\nBut we need to make sure that JabRef can always make the connection of the backup file and the original file. Maybe we need to hash the path for this to generate the name of the .bak file. \n =||= What about keeping them in the same folder but making them hidden files?\n(Booh... I haven't got my share of beer)\n =||= I think if you want to keep your TeX projects in Git revision, which we do, it will still bother you.\n =||= Indeed, I do not use Git for my projects.\nBut if I was using Git, why would I need a backup file?\nI believe Git will take care of the changes in my bib files, right?\n =||= Yes, but we are talking about the JabRef feature in particular.\n =||= So, why not to include in the database properties a \"enable/disable backup\"?\nHence, a given user can deactivate the backup when it is not needed (such as folders under Git/SVN).\n =||= I think this is already possible, but we want to change this to a non intrusive solution without bothering the user at all :blush:\n =||= Ah, ok!\n =||= "], ["88", "Improve Mac OS X building", "Oliver Kopp", "koppor", "01/26/16, 07:49:23 PM", "Currently, our MacAdapter class depends on `com.apple.*`. These classes are not available on a Linux or Windows JDK. Our current solution is to include [the legacy AppleJavaExtensions](https://developer.apple.com/legacy/library/samplecode/AppleJavaExtensions/Introduction/Intro.html), which are not available on jCenter. Another option is to use the [OrangeExtensions](http://ymasory.github.io/OrangeExtensions/). However, we use `com.apple.eawt.FullScreenUtilities`, which is not available.\n\nWe should get support of FullScreenUtilities into the OrangeExtensions and switch to them to get rid of AppleJavaExtensions.jar in the source repository.", "The project OrangeExtensions seems to be unmaintained with pull requests open since 2013. See https://github.com/ymasory/OrangeExtensions\n\nMay be we need to switch back to the .class file which is loaded dynamically?\n =||= I propose to create a fork and take over the development lead of the OrangeExtensions. @stefan-kolb WDYT?\n =||= It's hard to give a definitive answer for me, as I'm not using OSX. In my opinion we need someone who actively uses OSX and can test/evaluate more on this topic.\n\nAs far as I can tell Apple dropped the native support for its Apple-specific Java runtime.\n[1] https://developer.apple.com/library/mac/releasenotes/Java/JavaSnowLeopardUpdate3LeopardUpdate8RN/NewandNoteworthy/NewandNoteworthy.html#//apple_ref/doc/uid/TP40010380-CH4-SW1\n[2] http://stackoverflow.com/questions/24479016/how-to-get-apple-java-extensions-com-apple-eawt-work-on-jdk-7-and-higher\n[3] http://alvinalexander.com/java/java-mac-osx-about-preferences-quit-application-adapter\n\nHowever, we are only using custom events for AboutHandler, OpenFile, Preferences and Quit.\nI'm unsure how we should use and implement these stuff with newer OSX versions or if we already got it right. Official documentation seems hard to find. For me, this also makes it uncertain if we are going for the right approach with the OrangeExtension Stubs.\n\nAnyway, I think the switch to JavaFX will help tremendously in the effort of OS unification.\n =||= "], ["89", "Removes splash screen", "Simon Harrer", "simonharrer", "08/06/15, 12:54:20 PM", "This PR removes both the splash screen and the CLI option to disable the splash screen. \n\nWhy?\n- splash screen on modern systems is shown only for a very short period of time as JabRef starts fast\n- we should focus on making JabRef to start as fast as possible. A splash screen reduces the time to start the software as additional code needs to be executed. \n- for each new version (even for beta and dev versions), we have to check in a png with 200KB file size into the repository. This increases the amount of storage required for the git repository by 200KB for each version/dev-version.\n- The splash screen interferes with using JabRef via the CLI. \n- It reduces code in JabRef. Hence, less code needs to be maintained.\n\nThis is a PR that is open for discussion. Please add any pros/cons as you see fit. ", "I second this proposal :+1: \n =||= Make sense to me.\nAdditionally, among the feature requests, I found only one related to the splash screen, and the request was about an option to disable it.\n =||= I guess I have always taken the splash screen for granted, but this \nproposal actually makes sense. I support it.\n =||= Something similar is wished at [sf feature request 884](https://sourceforge.net/p/jabref/feature-requests/884/).\n\nMicrosoft Office products also show a splash screen. but it is shown much quicker than in JabRef. In JabRef, the time to show the splash screen is the same as from the splash screen to the full app, isn't it? Furthermore, most other apps don't have any splash screen.\n\nTherefore: :+1: \n =||= "], ["90", "Fix customized entry problem", "fc7", "fc7", "08/07/15, 04:05:24 PM", "This pull request contains, besides more or less minor code cleanup and refactoring, a bugfix for the problem with customized entry types (commit https://github.com/JabRef/jabref/commit/e92238a37cc780eb7fccc0684fa62d2437ddd825). See https://sourceforge.net/p/jabref/bugs/1221/ (with many duplicates)", "Looks good from a first sight. Two minor things: missing CHANGELOD entry and tabs instead of spaces (maybe IDE `formatter_settings.xml` are not enabled). I would opt for merging this PR, adding a CHANGELOG entry and let the formatter task do its work. \n =||= Thanks, I will take care of my formatter settings for future commits. Concerning the CHANGELOG, do you generally also include bugfixes in it? If not, this PR does not contain any new feature.\n =||= Yes, please include bugfixes as well.\n =||= "], ["91", "Consistent code formatting", "Oliver Kopp", "koppor", "08/20/15, 01:50:35 PM", "I renabled the `gradlew format` task in commit f6267c06c77cb6174e4b3800729a48e353da99be. Currently, this task destroys the `LabelPatternUtil` class. Furthermore, braces are not moved up. Maybe we should make the formatter more intrusive and enable `@formatter:off/on` tags for areas which are intended to be kept in separate lines.", ":+1: \n\nbut we should use `@formatter:off/on` as little as possible. \n =||= Is this done already? If not we should do a one pass asap and close this issue.\n =||= `LabelPatternUtil` was not destroyed. Don't know why, but that is good news. Commit is 6890a5d6.\n =||= "], ["92", "Availability in Windows Store", "Oliver Kopp", "koppor", "08/12/15, 08:16:25 AM", "It should be possible to install JabRef via the Windows Store.", "As JabRef is written in Java, I do not think this is currently possible.\n =||= "], ["93", "Logic improvements (Java 1.7+)", "Jörg Lenhard", "lenhard", "08/11/15, 11:34:25 AM", "This pull request features various improvements of the classes in the logic package with the aim to transition beyond Java 1.6 and improve quality. In particular:\n- Updates license headers with current date\n- Syntax optimizations: Java 1.7 use of generics (diamond operator)\n- Format code according to Java conventions (C-style curly brackets, I am looking at you)\n- Improves exception handling with logging\n- Replace usages of Exception with more precise Exceptions\n- Improves variable names\n- Removes commented-out code, unused private methods (unused public methods/constructors are not eliminated)\n- Use try-with-resources if possible\n- Delete stale comments\n- Replace StringBuffer with StringBuilder\n- Remove history information from JavaDoc\n\n(I am aware that I could push this directly, since I am now a contributor. As this started out as a pull request, I want to finish it as such. Future cotributions will be made directly to jabref/master)", "NaN"], ["94", "Removes functionality for additional fields via XML file", "Stefan Kolb", "stefan-kolb", "08/12/15, 07:55:14 AM", "The referenced XML file (`/resource/fields/fields.xml`) is not present and it is unclear how the functionality is used. Maybe some plugin needed it?\n\nTherefore, I'm proposing to remove this functionality for now.", "I tracked down the addition of this code to 5d5576aa687d2653aa9d0b4426aa1275b7e751b2. I think, `fields.xml` was never committed into the repository. It was a way before plugin functionality has been added. I think, we can remove the functionality for now.\n\nPossibly, the configuration of BibTeX entry types could be done globally with XML instead of constants in [BibtexEntryTypes.java](https://github.com/JabRef/jabref/blob/3610e3dc97ecad9ac78ce6a095e5d245a7e0d749/src/main/java/net/sf/jabref/BibtexEntryTypes.java).\n =||= "], ["95", "Reevaluate OpenFile workaround", "Stefan Kolb", "stefan-kolb", "08/12/15, 08:22:54 AM", "The code includes a specific workaround for opening files on Windows 9x (Microsoft Windows 95, 98, 98 SE und ME).\nReported by this bug: http://sourceforge.net/tracker/index.php?func=detail&aid=1489454&group_id=92314&atid=600306\nWe should reevaluate if the code is still necessary for Java 8 support.\nSee https://github.com/JabRef/jabref/blob/master/src/main/java/net/sf/jabref/util/Util.java#L484", "I think we can simplify the code as we can drop support for Windows 95/98. :)\n =||= "], ["96", "[WIP] Update each file to have a license header", "Simon Harrer", "simonharrer", "10/07/15, 09:45:14 AM", "Each java file now does have a license header, except the automatically generated ones.\n\nGradle now enforces that every .java file has a license header during the `check` task.\n\nWith `gradlew licenseFormat` one can generate the headers on new files automatically.", "Maybe it is a good idea to document the remaining problem childs here.\nWe can then try to resolve these issues or just keep the information here for reference after merging the PR.\n =||= "], ["97", "Remove old compatibility updates", "Stefan Kolb", "stefan-kolb", "09/28/15, 07:05:55 PM", "Do we still need this method to adapt JabRef preferences?\nhttps://github.com/JabRef/jabref/blob/f69e93368bcbe076a9874b4c9b31899623b061df/src/main/java/net/sf/jabref/util/Util.java#L575\nSeems like this is only needed for a very old JR version <= 1.55", "I think JR version <= 1.55 is too old. We can remove this upgrade method.\n =||= Hm. You intentionally waive compatibility, just to achieve a code saving of a handful lines? Or speeding up the application start?\n\nIt is clear what you loose, but what do you want to gain with this removal?\n =||= The current master branch is intended to be a major rewrite. \nVersion 1.55 dates back to 2004/11 (if this code is only for 1.55).\nQuite a few things will probably break in the transition to JabRef v3.\nWe try to get rid of a lot of 'minor' legacy hacks to make the code base maintainable again to be able move faster again :sweat_smile: \n =||= Ok, this is understandable.\n =||= @simonharrer You found another one?!\n =||= https://github.com/JabRef/jabref/blob/master/src/main/java/net/sf/jabref/groups/migrations/VersionHandling.java\n\nIt handles group versions 0, 1, 2 and 3. 3 is the current version of how groups are stored. One could still use an old group layout in their files.\n\nThis affects the bibtex file, as groups are stored in the bibtex file. I am not sure if they are updated automatically or if they are still used in the old format. \n\nThe other change only affects preferences which are automatically updated.\n =||= Jörg moved all this stuff into `PreferencesMigrations.java`, which is a good place to tidy things up.\nWe can discuss a removal later on. \nClosing for now.\n =||= "], ["98", "Refactor BibTeX file field", "Oliver Kopp", "koppor", "01/25/16, 05:20:31 PM", "JabRef should be convenient for new users to use. When using the `file` field, the format for each file entry is `description:link:type`. Multiple values can be put in separated by `;`. At each file, fields can be omitted. `file = {desc}` is a valid enry. Naively, I would have assumed that `desc` is the link. Furthermore `type` is a custom JabRef string, but [Media Types](http://www.iana.org/assignments/media-types/media-types.xhtml) are the accepted standard for providing types.\r\n\r\nTherefore, I propose the new format `link:description:media type`.\r\n\r\nFurthermore, I propose dropping support for the legacy fields pdf and ps. These fields were [legacy from the end of 2007 on](https://sourceforge.net/p/jabref/mailman/message/1369285/). Even though some users want to keep the old fields, I would vote for an intuitive handling of references to external files instead of clutter the UI with legacy things. (I currently can't find the email in the mailinglist where we discussed that :()\r\n\r\n## Discussion points\r\n\r\n- Is media type too over-engineered? Can we drop the type completely and derive the type by the  file extension?\r\n- Are `:` and `;` good separators?\r\n- Is `file` really more intuitive than separate `pdf` and `ps` links? Should we keep the `pdf` field?\r\n- Should the new field be called `attachments` to enable easy migration from the old format to the new one?\r\n\r\n## Next steps\r\n\r\nI would propose a discussion at this issue and I'll update this text accordingly.\r\n\r\nWe should also remove \"Tools -> Legacy Tools...\".\r\n\r\n## More to read\r\n\r\n- Old style: http://jabref.sourceforge.net/help/ExternalFiles.php\r\n- Current style: http://jabref.sourceforge.net/help/FileLinks.php\r", "About \"Should we keep the pdf field?\", I would say no IF it becomes possible to define several custom general fields to manage files (BTW: this is a registered feature request). Hence, users who want to have a PDF field and a PS field and a DVI field, etc. can get it.\n =||= Related feature request: https://sourceforge.net/p/jabref/feature-requests/597/\n(I didn't find the other @mlep mentioned, maybe someone else can?)\n =||= Sorry for not taking the time to point to the specific feature requests. See:\nhttp://sourceforge.net/p/jabref/feature-requests/282/\nhttp://sourceforge.net/p/jabref/feature-requests/129/\nhttp://sourceforge.net/p/jabref/feature-requests/163/\nhttp://sourceforge.net/p/jabref/feature-requests/64/\n =||= Also related: [DOS path in link](https://sourceforge.net/p/jabref/discussion/318825/thread/fa24606f/)\n =||= Before refactoring 'file' field, remember that there are at least one other\nBibTeX editor out there that depends on the JabRef format, namely\nEratosthenes for Android. I also think BibDesk can convert JabRef file\nlinks to its own format.\n =||= If the content of the file field does not contain `:` (== if someone justs pastes the file path into the field), we should interpret it as the path and not as the description. This solves the remaining problem in this issue in a straight-forward fashion.\n =||= "], ["99", "Rewrite DOI parsing", "Stefan Kolb", "stefan-kolb", "08/14/15, 09:21:02 AM", "I rewrote the DOI parser as it was hard to understand and missing quite a few valid DOIs.\nIt's not 100% but should be a lot better than before.\n- Clearer and more permissive Regex\n- Better URL encoding and decoding\n- More test coverage\n\nAny comments before merging this into master are appreciated.", "I did a quick test with clean up entries and all things work (DOI in note field, DOI and some text in note field, DOI in URL field, existing DOI).\n =||= "], ["100", "Move and refactor EntryEditor", "Jörg Lenhard", "lenhard", "08/14/15, 12:57:50 PM", "Moves the classes related to the EntryEditor into a separate GUI package and performs a few refactorings and quality improvements on the way.", ":+1: \n =||= "]]